GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_ddi.h
//     // Write 1AA to data bits 24:16 in high 16-bits of DDI_SLAVE_OFF register
//     // Note add 4 for high 16-bits at DDI_SLAVE_OFF; mask is 1ff!
//     HWREG(DDI_MASTER_BASE + DDI_SLAVE_OFF + DDI_O_MASK16B + 4) = 0x01ff01aa;
//
//     // Do an 8 bit masked write of 00 to low byte of register (data[7:0]).
//     // a short write is needed (16-bits).
//     HWREGH(DDI_MASTER_BASE + DDI_SLAVE_OFF + DDI_O_MASK16B) = 0xff00;
//
//     // Do an 8 bit masked write of 11 to byte 1 of register (data[15:8]).
//     // add 2 to get to byte 1.
//     HWREGH(DDI_MASTER_BASE + DDI_SLAVE_OFF + DDI_O_MASK16B + 2) = 0xff11;
//
//     // Do an 8 bit masked write of 33 to high byte of register (data[31:24]).
//     // add 6 to get to byte 3.
//     HWREGH(DDI_MASTER_BASE + DDI_SLAVE_OFF + DDI_O_MASK16B + 6) = 0xff33;
//
//     // Do an 4 bit masked write (Nibble) of 7 to data[3:0]).
//     // Byte write is needed.
//     HWREGB(DDI_MASTER_BASE + DDI_SLAVE_OFF + DDI_O_MASK16B) = 0xf7;
//
//     // Do an 4 bit masked write of 4 to data[7:4]).
//     // Add 1 for next nibble
//     HWREGB(DDI_MASTER_BASE + DDI_SLAVE_OFF + DDI_O_MASK16B + 1) = 0xf4;
//
//*****************************************************************************

//*****************************************************************************
//
// The following are defines for the DDI master instruction offsets.
//
//*****************************************************************************
#define DDI_O_DIR             0x00000000  // Offset for the direct access instruction
#define DDI_O_SET             0x00000040  // Offset for 'Set' instruction.
#define DDI_O_CLR             0x00000080  // Offset for 'Clear' instruction.
#define DDI_O_MASK4B          0x00000100  // Offset for 4-bit masked access.
                                          // Data bit[n] is written if mask bit[n] is set ('1').
                                          // Bits 7:4 are mask. Bits 3:0 are data.
                                          // Requires 'byte' write.
#define DDI_O_MASK8B          0x00000180  // Offset for 8-bit masked access.
                                          // Data bit[n] is written if mask bit[n] is set ('1').
                                          // Bits 15:8 are mask. Bits 7:0 are data.
                                          // Requires 'short' write.
#define DDI_O_MASK16B         0x00000200  // Offset for 16-bit masked access.
                                          // Data bit[n] is written if mask bit[n] is set ('1').
                                          // Bits 31:16 are mask. Bits 15:0 are data.
                                          // Requires 'long' write.

//*****************************************************************************
//
// The following are defines for the DDI register offsets.
//
//*****************************************************************************
#define DDI_O_SLAVESTAT         0x000000C0  // DDI Slave status register
#define DDI_O_SLAVECONF         0x000000C8  // DDI Slave configuration
                                            // register

//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_SLAVESTAT register.
//
//*****************************************************************************
#define DDI_SLAVESTAT_DI_REQ    0x00000002  // Read current value of DI_REQ
                                            // signal. Writing 0 to this bit
                                            // forces a sync with slave,
                                            // ensuring that req will be 0. It
                                            // is recommended to write 0 to
                                            // this register before power down
                                            // of the master.
#define DDI_SLAVESTAT_DI_REQ_M  0x00000002
#define DDI_SLAVESTAT_DI_REQ_S  1
#define DDI_SLAVESTAT_DI_ACK    0x00000001  // Read current value of DI_ACK
                                            // signal
#define DDI_SLAVESTAT_DI_ACK_M  0x00000001
#define DDI_SLAVESTAT_DI_ACK_S  0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_SLAVECONF register.
//
//*****************************************************************************
#define DDI_SLAVECONF_CONFLOCK  0x00000080  // This register is no longer
                                            // accessible when this bit is set.
                                            // (unless sticky_bit_overwrite is
                                            // asserted on top module)
#define DDI_SLAVECONF_CONFLOCK_M \
                                0x00000080
#define DDI_SLAVECONF_CONFLOCK_S 7
#define DDI_SLAVECONF_WAITFORACK \
                                0x00000004  // A transaction does not end
                                            // until ack has been received when
                                            // this bit is set.

#define DDI_SLAVECONF_WAITFORACK_M \
                                0x00000004
#define DDI_SLAVECONF_WAITFORACK_S 2
#define DDI_SLAVECONF_DDICLKSPEED_M \
                                0x00000003  // Sets the period of an DDI
                                            // transactions. All transactions
                                            // takes an even number of clock
                                            // cycles,- DDI clock rising edge
                                            // occurs in the middle of the
                                            // period. Data and ctrl to slave
                                            // is set up in beginning of cycle,
                                            // and data from slave is read in
                                            // after the transaction 00: An DDI
                                            // transaction takes 2 master clock
                                            // cyclkes 01: An DDI transaction
                                            // takes 4 master clock cycles 10:
                                            // And DDI Transaction takes 8
                                            // master clock cycles 11: An DDI
                                            // transaction takes 16 master
                                            // clock cycles

#define DDI_SLAVECONF_DDICLKSPEED_S 0


