GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_ddi.h
                                            // register 32
#define DDI_MASK4B3233_M0L_S    4
#define DDI_MASK4B3233_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 32, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B3233_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B3435 register.
//
//*****************************************************************************
#define DDI_MASK4B3435_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 35
#define DDI_MASK4B3435_M1H_S    28
#define DDI_MASK4B3435_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 35, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B3435_D1H_S    24
#define DDI_MASK4B3435_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 35
#define DDI_MASK4B3435_M1L_S    20
#define DDI_MASK4B3435_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 35, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B3435_D1L_S    16
#define DDI_MASK4B3435_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 34
#define DDI_MASK4B3435_M0H_S    12
#define DDI_MASK4B3435_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 34, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B3435_D0H_S    8
#define DDI_MASK4B3435_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 34
#define DDI_MASK4B3435_M0L_S    4
#define DDI_MASK4B3435_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 34, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B3435_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B3637 register.
//
//*****************************************************************************
#define DDI_MASK4B3637_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 37
#define DDI_MASK4B3637_M1H_S    28
#define DDI_MASK4B3637_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 37, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B3637_D1H_S    24
#define DDI_MASK4B3637_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 37
#define DDI_MASK4B3637_M1L_S    20
#define DDI_MASK4B3637_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 37, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B3637_D1L_S    16
#define DDI_MASK4B3637_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 36
#define DDI_MASK4B3637_M0H_S    12
#define DDI_MASK4B3637_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 36, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B3637_D0H_S    8
#define DDI_MASK4B3637_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 36
#define DDI_MASK4B3637_M0L_S    4
#define DDI_MASK4B3637_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 36, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B3637_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B3839 register.
//
//*****************************************************************************
#define DDI_MASK4B3839_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 39
#define DDI_MASK4B3839_M1H_S    28
#define DDI_MASK4B3839_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 39, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B3839_D1H_S    24
#define DDI_MASK4B3839_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 39
#define DDI_MASK4B3839_M1L_S    20
#define DDI_MASK4B3839_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 39, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B3839_D1L_S    16
#define DDI_MASK4B3839_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 38
#define DDI_MASK4B3839_M0H_S    12
#define DDI_MASK4B3839_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 38, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B3839_D0H_S    8
#define DDI_MASK4B3839_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 38
#define DDI_MASK4B3839_M0L_S    4
#define DDI_MASK4B3839_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 38, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B3839_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B4041 register.
//
//*****************************************************************************
#define DDI_MASK4B4041_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 41
#define DDI_MASK4B4041_M1H_S    28
#define DDI_MASK4B4041_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 41, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B4041_D1H_S    24
#define DDI_MASK4B4041_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 41
#define DDI_MASK4B4041_M1L_S    20
#define DDI_MASK4B4041_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 41, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B4041_D1L_S    16
#define DDI_MASK4B4041_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 40
#define DDI_MASK4B4041_M0H_S    12
#define DDI_MASK4B4041_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 40, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B4041_D0H_S    8
#define DDI_MASK4B4041_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 40
#define DDI_MASK4B4041_M0L_S    4
#define DDI_MASK4B4041_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 40, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B4041_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B4243 register.
//
//*****************************************************************************
#define DDI_MASK4B4243_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 43
#define DDI_MASK4B4243_M1H_S    28
#define DDI_MASK4B4243_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 43, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B4243_D1H_S    24
#define DDI_MASK4B4243_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 43
#define DDI_MASK4B4243_M1L_S    20
#define DDI_MASK4B4243_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 43, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B4243_D1L_S    16
#define DDI_MASK4B4243_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 42
#define DDI_MASK4B4243_M0H_S    12
#define DDI_MASK4B4243_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 42, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B4243_D0H_S    8
#define DDI_MASK4B4243_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 42
#define DDI_MASK4B4243_M0L_S    4
#define DDI_MASK4B4243_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 42, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B4243_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B4445 register.
//
//*****************************************************************************
#define DDI_MASK4B4445_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 45
#define DDI_MASK4B4445_M1H_S    28
#define DDI_MASK4B4445_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 45, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B4445_D1H_S    24
#define DDI_MASK4B4445_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 45
#define DDI_MASK4B4445_M1L_S    20
#define DDI_MASK4B4445_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 45, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B4445_D1L_S    16
#define DDI_MASK4B4445_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 44
#define DDI_MASK4B4445_M0H_S    12
#define DDI_MASK4B4445_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 44, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B4445_D0H_S    8
#define DDI_MASK4B4445_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 44
#define DDI_MASK4B4445_M0L_S    4
#define DDI_MASK4B4445_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 44, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B4445_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B4647 register.
//
//*****************************************************************************
#define DDI_MASK4B4647_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 47
#define DDI_MASK4B4647_M1H_S    28
#define DDI_MASK4B4647_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 47, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B4647_D1H_S    24
#define DDI_MASK4B4647_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 47
#define DDI_MASK4B4647_M1L_S    20
#define DDI_MASK4B4647_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 47, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B4647_D1L_S    16
#define DDI_MASK4B4647_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 46
#define DDI_MASK4B4647_M0H_S    12
#define DDI_MASK4B4647_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 46, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B4647_D0H_S    8
#define DDI_MASK4B4647_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 46
#define DDI_MASK4B4647_M0L_S    4
#define DDI_MASK4B4647_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 46, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B4647_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B4849 register.
//
//*****************************************************************************
#define DDI_MASK4B4849_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 49
#define DDI_MASK4B4849_M1H_S    28
#define DDI_MASK4B4849_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 49, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B4849_D1H_S    24
#define DDI_MASK4B4849_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 49
#define DDI_MASK4B4849_M1L_S    20
#define DDI_MASK4B4849_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 49, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B4849_D1L_S    16
#define DDI_MASK4B4849_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 48
#define DDI_MASK4B4849_M0H_S    12
#define DDI_MASK4B4849_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 48, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B4849_D0H_S    8
#define DDI_MASK4B4849_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 48
#define DDI_MASK4B4849_M0L_S    4
#define DDI_MASK4B4849_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 48, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B4849_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B5051 register.
//
//*****************************************************************************
#define DDI_MASK4B5051_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 51
#define DDI_MASK4B5051_M1H_S    28
#define DDI_MASK4B5051_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 51, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B5051_D1H_S    24
#define DDI_MASK4B5051_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 51
#define DDI_MASK4B5051_M1L_S    20
#define DDI_MASK4B5051_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 51, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B5051_D1L_S    16
#define DDI_MASK4B5051_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 50
#define DDI_MASK4B5051_M0H_S    12
#define DDI_MASK4B5051_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 50, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B5051_D0H_S    8
#define DDI_MASK4B5051_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 50
#define DDI_MASK4B5051_M0L_S    4
#define DDI_MASK4B5051_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 50, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B5051_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B5253 register.
//
//*****************************************************************************
#define DDI_MASK4B5253_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 53
#define DDI_MASK4B5253_M1H_S    28
#define DDI_MASK4B5253_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 53, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B5253_D1H_S    24
#define DDI_MASK4B5253_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 53
#define DDI_MASK4B5253_M1L_S    20
#define DDI_MASK4B5253_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 53, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B5253_D1L_S    16
#define DDI_MASK4B5253_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 52
#define DDI_MASK4B5253_M0H_S    12
#define DDI_MASK4B5253_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 52, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B5253_D0H_S    8
#define DDI_MASK4B5253_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 52
#define DDI_MASK4B5253_M0L_S    4
#define DDI_MASK4B5253_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 52, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B5253_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B5455 register.
//
//*****************************************************************************
#define DDI_MASK4B5455_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 55
#define DDI_MASK4B5455_M1H_S    28
#define DDI_MASK4B5455_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 55, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B5455_D1H_S    24
#define DDI_MASK4B5455_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 55
#define DDI_MASK4B5455_M1L_S    20
#define DDI_MASK4B5455_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 55, - only bits
