GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_ddi.h
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B5455_D1L_S    16
#define DDI_MASK4B5455_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 54
#define DDI_MASK4B5455_M0H_S    12
#define DDI_MASK4B5455_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 54, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B5455_D0H_S    8
#define DDI_MASK4B5455_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 54
#define DDI_MASK4B5455_M0L_S    4
#define DDI_MASK4B5455_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 54, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B5455_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B5657 register.
//
//*****************************************************************************
#define DDI_MASK4B5657_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 57
#define DDI_MASK4B5657_M1H_S    28
#define DDI_MASK4B5657_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 57, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B5657_D1H_S    24
#define DDI_MASK4B5657_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 57
#define DDI_MASK4B5657_M1L_S    20
#define DDI_MASK4B5657_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 57, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B5657_D1L_S    16
#define DDI_MASK4B5657_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 56
#define DDI_MASK4B5657_M0H_S    12
#define DDI_MASK4B5657_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 56, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B5657_D0H_S    8
#define DDI_MASK4B5657_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 56
#define DDI_MASK4B5657_M0L_S    4
#define DDI_MASK4B5657_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 56, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B5657_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B5859 register.
//
//*****************************************************************************
#define DDI_MASK4B5859_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 59
#define DDI_MASK4B5859_M1H_S    28
#define DDI_MASK4B5859_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 59, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B5859_D1H_S    24
#define DDI_MASK4B5859_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 59
#define DDI_MASK4B5859_M1L_S    20
#define DDI_MASK4B5859_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 59, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B5859_D1L_S    16
#define DDI_MASK4B5859_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 58
#define DDI_MASK4B5859_M0H_S    12
#define DDI_MASK4B5859_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 58, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B5859_D0H_S    8
#define DDI_MASK4B5859_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 58
#define DDI_MASK4B5859_M0L_S    4
#define DDI_MASK4B5859_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 58, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B5859_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B6061 register.
//
//*****************************************************************************
#define DDI_MASK4B6061_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 61
#define DDI_MASK4B6061_M1H_S    28
#define DDI_MASK4B6061_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 61, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B6061_D1H_S    24
#define DDI_MASK4B6061_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 61
#define DDI_MASK4B6061_M1L_S    20
#define DDI_MASK4B6061_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 61, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B6061_D1L_S    16
#define DDI_MASK4B6061_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 60
#define DDI_MASK4B6061_M0H_S    12
#define DDI_MASK4B6061_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 60, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B6061_D0H_S    8
#define DDI_MASK4B6061_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 60
#define DDI_MASK4B6061_M0L_S    4
#define DDI_MASK4B6061_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 60, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B6061_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK4B6263 register.
//
//*****************************************************************************
#define DDI_MASK4B6263_M1H_M    0xF0000000  // Mask for bits [7:4] in DDI
                                            // register 63
#define DDI_MASK4B6263_M1H_S    28
#define DDI_MASK4B6263_D1H_M    0x0F000000  // Data for bits [7:4] in DDI
                                            // register 63, - only bits
                                            // selected by mask M1H will be
                                            // affected by access
#define DDI_MASK4B6263_D1H_S    24
#define DDI_MASK4B6263_M1L_M    0x00F00000  // Mask for bits [3:0] in DDI
                                            // register 63
#define DDI_MASK4B6263_M1L_S    20
#define DDI_MASK4B6263_D1L_M    0x000F0000  // Data for bits [3:0] in DDI
                                            // register 63, - only bits
                                            // selected by mask M1L will be
                                            // affected by access
#define DDI_MASK4B6263_D1L_S    16
#define DDI_MASK4B6263_M0H_M    0x0000F000  // Mask for bits [7:4] in DDI
                                            // register 62
#define DDI_MASK4B6263_M0H_S    12
#define DDI_MASK4B6263_D0H_M    0x00000F00  // Data for bits [7:4] in DDI
                                            // register 62, - only bits
                                            // selected by mask M0H will be
                                            // affected by access
#define DDI_MASK4B6263_D0H_S    8
#define DDI_MASK4B6263_M0L_M    0x000000F0  // Mask for bits [3:0] in DDI
                                            // register 62
#define DDI_MASK4B6263_M0L_S    4
#define DDI_MASK4B6263_D0L_M    0x0000000F  // Data for bits [3:0] in DDI
                                            // register 62, - only bits
                                            // selected by mask M0L will be
                                            // affected by access
#define DDI_MASK4B6263_D0L_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_MASK8B01 register.
//
//*****************************************************************************
#define DDI_MASK8B01_M1_M       0xFF000000  // Mask for DDI register 1
#define DDI_MASK8B01_M1_S       24
#define DDI_MASK8B01_D1_M       0x00FF0000  // Data for DDI register 1, - only
                                            // bits selected by mask M1 will be
                                            // affected by access
#define DDI_MASK8B01_D1_S       16
#define DDI_MASK8B01_M0_M       0x0000FF00  // Mask for DDI register 0
#define DDI_MASK8B01_M0_S       8
#define DDI_MASK8B01_D0_M       0x000000FF  // Data for DDI register 0, - only
                                            // bits selected by mask M0 will be
                                            // affected by access
#define DDI_MASK8B01_D0_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_MASK8B23 register.
//
//*****************************************************************************
#define DDI_MASK8B23_M1_M       0xFF000000  // Mask for DDI register 3
#define DDI_MASK8B23_M1_S       24
#define DDI_MASK8B23_D1_M       0x00FF0000  // Data for DDI register 3, - only
                                            // bits selected by mask M1 will be
                                            // affected by access
#define DDI_MASK8B23_D1_S       16
#define DDI_MASK8B23_M0_M       0x0000FF00  // Mask for DDI register 2
#define DDI_MASK8B23_M0_S       8
#define DDI_MASK8B23_D0_M       0x000000FF  // Data for DDI register 2, - only
                                            // bits selected by mask M0 will be
                                            // affected by access
#define DDI_MASK8B23_D0_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_MASK8B45 register.
//
//*****************************************************************************
#define DDI_MASK8B45_M1_M       0xFF000000  // Mask for DDI register 5
#define DDI_MASK8B45_M1_S       24
#define DDI_MASK8B45_D1_M       0x00FF0000  // Data for DDI register 5, - only
                                            // bits selected by mask M1 will be
                                            // affected by access
#define DDI_MASK8B45_D1_S       16
#define DDI_MASK8B45_M0_M       0x0000FF00  // Mask for DDI register 4
#define DDI_MASK8B45_M0_S       8
#define DDI_MASK8B45_D0_M       0x000000FF  // Data for DDI register 4, - only
                                            // bits selected by mask M0 will be
                                            // affected by access
#define DDI_MASK8B45_D0_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_MASK8B67 register.
//
//*****************************************************************************
#define DDI_MASK8B67_M1_M       0xFF000000  // Mask for DDI register 7
#define DDI_MASK8B67_M1_S       24
#define DDI_MASK8B67_D1_M       0x00FF0000  // Data for DDI register 7, - only
                                            // bits selected by mask M1 will be
                                            // affected by access
#define DDI_MASK8B67_D1_S       16
#define DDI_MASK8B67_M0_M       0x0000FF00  // Mask for DDI register 6
#define DDI_MASK8B67_M0_S       8
#define DDI_MASK8B67_D0_M       0x000000FF  // Data for DDI register 6, - only
                                            // bits selected by mask M0 will be
                                            // affected by access
#define DDI_MASK8B67_D0_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_MASK8B89 register.
//
//*****************************************************************************
#define DDI_MASK8B89_M1_M       0xFF000000  // Mask for DDI register 9
#define DDI_MASK8B89_M1_S       24
#define DDI_MASK8B89_D1_M       0x00FF0000  // Data for DDI register 9, - only
                                            // bits selected by mask M1 will be
                                            // affected by access
#define DDI_MASK8B89_D1_S       16
#define DDI_MASK8B89_M0_M       0x0000FF00  // Mask for DDI register 8
#define DDI_MASK8B89_M0_S       8
#define DDI_MASK8B89_D0_M       0x000000FF  // Data for DDI register 8, - only
                                            // bits selected by mask M0 will be
                                            // affected by access
#define DDI_MASK8B89_D0_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK8B1011 register.
//
//*****************************************************************************
#define DDI_MASK8B1011_M1_M     0xFF000000  // Mask for DDI register 11
#define DDI_MASK8B1011_M1_S     24
#define DDI_MASK8B1011_D1_M     0x00FF0000  // Data for DDI register 11, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define DDI_MASK8B1011_D1_S     16
#define DDI_MASK8B1011_M0_M     0x0000FF00  // Mask for DDI register 10
#define DDI_MASK8B1011_M0_S     8
#define DDI_MASK8B1011_D0_M     0x000000FF  // Data for DDI register 10, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define DDI_MASK8B1011_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK8B1213 register.
//
//*****************************************************************************
#define DDI_MASK8B1213_M1_M     0xFF000000  // Mask for DDI register 13
#define DDI_MASK8B1213_M1_S     24
#define DDI_MASK8B1213_D1_M     0x00FF0000  // Data for DDI register 13, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define DDI_MASK8B1213_D1_S     16
#define DDI_MASK8B1213_M0_M     0x0000FF00  // Mask for DDI register 12
#define DDI_MASK8B1213_M0_S     8
#define DDI_MASK8B1213_D0_M     0x000000FF  // Data for DDI register 12, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define DDI_MASK8B1213_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK8B1415 register.
//
//*****************************************************************************
#define DDI_MASK8B1415_M1_M     0xFF000000  // Mask for DDI register 15
#define DDI_MASK8B1415_M1_S     24
#define DDI_MASK8B1415_D1_M     0x00FF0000  // Data for DDI register 15, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define DDI_MASK8B1415_D1_S     16
#define DDI_MASK8B1415_M0_M     0x0000FF00  // Mask for DDI register 14
#define DDI_MASK8B1415_M0_S     8
#define DDI_MASK8B1415_D0_M     0x000000FF  // Data for DDI register 14, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define DDI_MASK8B1415_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK8B1617 register.
//
//*****************************************************************************
#define DDI_MASK8B1617_M1_M     0xFF000000  // Mask for DDI register 17
#define DDI_MASK8B1617_M1_S     24
#define DDI_MASK8B1617_D1_M     0x00FF0000  // Data for DDI register 17, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define DDI_MASK8B1617_D1_S     16
#define DDI_MASK8B1617_M0_M     0x0000FF00  // Mask for DDI register 16
#define DDI_MASK8B1617_M0_S     8
#define DDI_MASK8B1617_D0_M     0x000000FF  // Data for DDI register 16, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define DDI_MASK8B1617_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK8B1819 register.
//
//*****************************************************************************
#define DDI_MASK8B1819_M1_M     0xFF000000  // Mask for DDI register 19
#define DDI_MASK8B1819_M1_S     24
#define DDI_MASK8B1819_D1_M     0x00FF0000  // Data for DDI register 19, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define DDI_MASK8B1819_D1_S     16
#define DDI_MASK8B1819_M0_M     0x0000FF00  // Mask for DDI register 18
#define DDI_MASK8B1819_M0_S     8
#define DDI_MASK8B1819_D0_M     0x000000FF  // Data for DDI register 18, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define DDI_MASK8B1819_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK8B2021 register.
//
//*****************************************************************************
#define DDI_MASK8B2021_M1_M     0xFF000000  // Mask for DDI register 21
#define DDI_MASK8B2021_M1_S     24
#define DDI_MASK8B2021_D1_M     0x00FF0000  // Data for DDI register 21, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define DDI_MASK8B2021_D1_S     16
#define DDI_MASK8B2021_M0_M     0x0000FF00  // Mask for DDI register 20
#define DDI_MASK8B2021_M0_S     8
#define DDI_MASK8B2021_D0_M     0x000000FF  // Data for DDI register 20, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define DDI_MASK8B2021_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK8B2223 register.
//
//*****************************************************************************
#define DDI_MASK8B2223_M1_M     0xFF000000  // Mask for DDI register 23
#define DDI_MASK8B2223_M1_S     24
#define DDI_MASK8B2223_D1_M     0x00FF0000  // Data for DDI register 23, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define DDI_MASK8B2223_D1_S     16
#define DDI_MASK8B2223_M0_M     0x0000FF00  // Mask for DDI register 22
#define DDI_MASK8B2223_M0_S     8
#define DDI_MASK8B2223_D0_M     0x000000FF  // Data for DDI register 22, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define DDI_MASK8B2223_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK8B2425 register.
//
//*****************************************************************************
#define DDI_MASK8B2425_M1_M     0xFF000000  // Mask for DDI register 25
#define DDI_MASK8B2425_M1_S     24
#define DDI_MASK8B2425_D1_M     0x00FF0000  // Data for DDI register 25, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define DDI_MASK8B2425_D1_S     16
#define DDI_MASK8B2425_M0_M     0x0000FF00  // Mask for DDI register 24
#define DDI_MASK8B2425_M0_S     8
#define DDI_MASK8B2425_D0_M     0x000000FF  // Data for DDI register 24, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define DDI_MASK8B2425_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK8B2627 register.
//
//*****************************************************************************
#define DDI_MASK8B2627_M1_M     0xFF000000  // Mask for DDI register 27
#define DDI_MASK8B2627_M1_S     24
#define DDI_MASK8B2627_D1_M     0x00FF0000  // Data for DDI register 27, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define DDI_MASK8B2627_D1_S     16
#define DDI_MASK8B2627_M0_M     0x0000FF00  // Mask for DDI register 26
#define DDI_MASK8B2627_M0_S     8
#define DDI_MASK8B2627_D0_M     0x000000FF  // Data for DDI register 26, -
